; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph3 - mode
	thermograph1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star3 - direction
	Star2 - direction
	Star4 - direction
	Star1 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
)
(:goal (and
	(pointing satellite2 Star2)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 thermograph1)
	(have_image Star10 thermograph3)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon13 spectrograph4)
	(have_image Star14 spectrograph0)
	(have_image Planet15 thermograph2)
))

)

; plan
1. (turn_to satellite2 star1 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star1)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon8 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon8)
   goals met: 0 of 9
5. (take_image satellite2 phenomenon8 instrument4 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon13 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
7. (turn_to satellite1 star1 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star1)
   goals met: 1 of 9
8. (take_image satellite2 phenomenon13 instrument4 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 2 of 9
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 9
10. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 2 of 9
11. (turn_to satellite1 phenomenon12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 9
12. (take_image satellite1 phenomenon12 instrument2 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 3 of 9
13. (turn_to satellite1 planet11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet11)
   goals met: 3 of 9
14. (take_image satellite1 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 9
15. (turn_to satellite1 planet15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet15)
   goals met: 4 of 9
16. (take_image satellite1 planet15 instrument2 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 5 of 9
17. (turn_to satellite1 planet9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet9)
   goals met: 5 of 9
18. (take_image satellite1 planet9 instrument2 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 6 of 9
19. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 6 of 9
20. (take_image satellite1 star10 instrument2 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 7 of 9
21. (turn_to satellite2 star14 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star14)
   goals met: 7 of 9
22. (take_image satellite2 star14 instrument4 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 8 of 9
23. (turn_to satellite2 star2 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star2)
   goals met: 9 of 9
